4
loading data from ../data/7class_simple_normalized/
Using real-time data augmentation
Loading network/training configuration...
Model summary...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 64, 48, 48)    640         convolution2d_input_1[0][0]      
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 64, 48, 48)    36928       convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 64, 24, 24)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 64, 24, 24)    96          maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 64, 24, 24)    0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 128, 24, 24)   73856       dropout_1[0][0]                  
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 128, 24, 24)   147584      convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 128, 12, 12)   0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 128, 12, 12)   48          maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 128, 12, 12)   0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 256, 12, 12)   295168      dropout_2[0][0]                  
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 256, 12, 12)   590080      convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 256, 6, 6)     0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 256, 6, 6)     24          maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 256, 6, 6)     0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 512, 6, 6)     1180160     dropout_3[0][0]                  
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 512, 6, 6)     2359808     convolution2d_7[0][0]            
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)    (None, 512, 3, 3)     0           convolution2d_8[0][0]            
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 512, 3, 3)     12          maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 512, 3, 3)     0           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 4608)          0           dropout_4[0][0]                  
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          4719616     flatten_1[0][0]                  
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 1024)          0           dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1024)          0           activation_1[0][0]               
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 7)             7175        dropout_5[0][0]                  
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 7)             0           dense_2[0][0]                    
====================================================================================================
Total params: 9,411,195
Trainable params: 9,411,105
Non-trainable params: 90
____________________________________________________________________________________________________
None
X_train shape:  (28709, 1, 48, 48)
y_train shape:  (28709, 7)
  img size:  48 48
batch size:  128
  nb_epoch:  1
Saving model plot...
running without data augmentation
Train on 28709 samples, validate on 3589 samples
Epoch 1/1
  128/28709 [..............................] - ETA: 1223s - loss: 32.3147 - acc: 0.1328  256/28709 [..............................] - ETA: 728s - loss: 73.9141 - acc: 0.1484   384/28709 [..............................] - ETA: 564s - loss: 3655.1384 - acc: 0.1562  512/28709 [..............................] - ETA: 477s - loss: 2903.4850 - acc: 0.1836  640/28709 [..............................] - ETA: 425s - loss: 2588.0924 - acc: 0.1859  768/28709 [..............................] - ETA: 390s - loss: 2478.3246 - acc: 0.1758  896/28709 [..............................] - ETA: 365s - loss: 2289.3126 - acc: 0.1696 1024/28709 [>.............................] - ETA: 346s - loss: 2053.8189 - acc: 0.1670 1152/28709 [>.............................] - ETA: 332s - loss: 1862.9116 - acc: 0.1641 1280/28709 [>.............................] - ETA: 320s - loss: 1732.7056 - acc: 0.1641 1408/28709 [>.............................] - ETA: 310s - loss: 1612.0426 - acc: 0.1669 1536/28709 [>.............................] - ETA: 300s - loss: 1496.1328 - acc: 0.1647 1664/28709 [>.............................] - ETA: 294s - loss: 1393.3632 - acc: 0.1593 1792/28709 [>.............................] - ETA: 286s - loss: 1310.2614 - acc: 0.1562 1920/28709 [=>............................] - ETA: 280s - loss: 1237.1027 - acc: 0.1531 2048/28709 [=>............................] - ETA: 275s - loss: 1169.2493 - acc: 0.1533 2176/28709 [=>............................] - ETA: 270s - loss: 1105.8479 - acc: 0.1540 2304/28709 [=>............................] - ETA: 265s - loss: 1047.0615 - acc: 0.1541 2432/28709 [=>............................] - ETA: 261s - loss: 996.3958 - acc: 0.1513  2560/28709 [=>............................] - ETA: 258s - loss: 953.0729 - acc: 0.1516 2688/28709 [=>............................] - ETA: 254s - loss: 911.3147 - acc: 0.1522 2816/28709 [=>............................] - ETA: 252s - loss: 872.1803 - acc: 0.1538 2944/28709 [==>...........................] - ETA: 249s - loss: 835.5372 - acc: 0.1549 3072/28709 [==>...........................] - ETA: 246s - loss: 802.2048 - acc: 0.1536 3200/28709 [==>...........................] - ETA: 244s - loss: 772.0370 - acc: 0.1553 3328/28709 [==>...........................] - ETA: 242s - loss: 744.6067 - acc: 0.1566 3456/28709 [==>...........................] - ETA: 239s - loss: 718.8418 - acc: 0.1548 3584/28709 [==>...........................] - ETA: 237s - loss: 694.2361 - acc: 0.1602 3712/28709 [==>...........................] - ETA: 235s - loss: 671.0842 - acc: 0.1619 3840/28709 [===>..........................] - ETA: 233s - loss: 649.5040 - acc: 0.1661 3968/28709 [===>..........................] - ETA: 231s - loss: 629.5725 - acc: 0.1683 4096/28709 [===>..........................] - ETA: 229s - loss: 610.9455 - acc: 0.1714 4224/28709 [===>..........................] - ETA: 227s - loss: 593.2491 - acc: 0.1728 4352/28709 [===>..........................] - ETA: 225s - loss: 576.3868 - acc: 0.1753 4480/28709 [===>..........................] - ETA: 223s - loss: 560.4540 - acc: 0.1757 4608/28709 [===>..........................] - ETA: 221s - loss: 545.3898 - acc: 0.1769 4736/28709 [===>..........................] - ETA: 219s - loss: 531.2435 - acc: 0.1788 4864/28709 [====>.........................] - ETA: 217s - loss: 517.8874 - acc: 0.1803 4992/28709 [====>.........................] - ETA: 215s - loss: 505.1096 - acc: 0.1803 5120/28709 [====>.........................] - ETA: 213s - loss: 492.8934 - acc: 0.1809 5248/28709 [====>.........................] - ETA: 212s - loss: 481.2474 - acc: 0.1812 5376/28709 [====>.........................] - ETA: 211s - loss: 470.2069 - acc: 0.1810 5504/28709 [====>.........................] - ETA: 209s - loss: 459.6417 - acc: 0.1819 5632/28709 [====>.........................] - ETA: 208s - loss: 449.5436 - acc: 0.1834 5760/28709 [=====>........................] - ETA: 206s - loss: 439.9301 - acc: 0.1840 5888/28709 [=====>........................] - ETA: 205s - loss: 430.6803 - acc: 0.1844 6016/28709 [=====>........................] - ETA: 203s - loss: 421.8380 - acc: 0.1847 6144/28709 [=====>........................] - ETA: 202s - loss: 413.3308 - acc: 0.1834 6272/28709 [=====>........................] - ETA: 201s - loss: 405.2200 - acc: 0.1830 6400/28709 [=====>........................] - ETA: 200s - loss: 397.3933 - acc: 0.1827 6528/28709 [=====>........................] - ETA: 198s - loss: 389.8838 - acc: 0.1828 6656/28709 [=====>........................] - ETA: 197s - loss: 382.6557 - acc: 0.1839 6784/28709 [======>.......................] - ETA: 196s - loss: 375.6832 - acc: 0.1850 6912/28709 [======>.......................] - ETA: 194s - loss: 368.9596 - acc: 0.1862 7040/28709 [======>.......................] - ETA: 193s - loss: 362.4867 - acc: 0.1857 7168/28709 [======>.......................] - ETA: 192s - loss: 356.2482 - acc: 0.1858 7296/28709 [======>.......................] - ETA: 190s - loss: 350.2140 - acc: 0.1856 7424/28709 [======>.......................] - ETA: 189s - loss: 344.3967 - acc: 0.1853 7552/28709 [======>.......................] - ETA: 188s - loss: 338.7806 - acc: 0.1856 7680/28709 [=======>......................] - ETA: 187s - loss: 333.3450 - acc: 0.1867 7808/28709 [=======>......................] - ETA: 185s - loss: 328.0741 - acc: 0.1871 7936/28709 [=======>......................] - ETA: 184s - loss: 322.9811 - acc: 0.1871 8064/28709 [=======>......................] - ETA: 183s - loss: 318.0497 - acc: 0.1875 8192/28709 [=======>......................] - ETA: 181s - loss: 313.2672 - acc: 0.1882 8320/28709 [=======>......................] - ETA: 180s - loss: 308.6218 - acc: 0.1871 8448/28709 [=======>......................] - ETA: 179s - loss: 304.1176 - acc: 0.1875 8576/28709 [=======>......................] - ETA: 178s - loss: 299.7422 - acc: 0.1878 8704/28709 [========>.....................] - ETA: 177s - loss: 295.5009 - acc: 0.1878 8832/28709 [========>.....................] - ETA: 175s - loss: 291.3736 - acc: 0.1880 8960/28709 [========>.....................] - ETA: 174s - loss: 287.3761 - acc: 0.1878 9088/28709 [========>.....................] - ETA: 173s - loss: 283.4840 - acc: 0.1884 9216/28709 [========>.....................] - ETA: 172s - loss: 279.6845 - acc: 0.1886 9344/28709 [========>.....................] - ETA: 170s - loss: 275.9994 - acc: 0.1887 9472/28709 [========>.....................] - ETA: 169s - loss: 272.4097 - acc: 0.1887 9600/28709 [=========>....................] - ETA: 168s - loss: 268.9207 - acc: 0.1892 9728/28709 [=========>....................] - ETA: 167s - loss: 265.5500 - acc: 0.1886 9856/28709 [=========>....................] - ETA: 166s - loss: 262.2580 - acc: 0.1888 9984/28709 [=========>....................] - ETA: 165s - loss: 259.0330 - acc: 0.187710112/28709 [=========>....................] - ETA: 164s - loss: 255.8957 - acc: 0.188310240/28709 [=========>....................] - ETA: 162s - loss: 252.8712 - acc: 0.188110368/28709 [=========>....................] - ETA: 161s - loss: 249.8851 - acc: 0.188310496/28709 [=========>....................] - ETA: 160s - loss: 246.9698 - acc: 0.187810624/28709 [==========>...................] - ETA: 159s - loss: 244.1267 - acc: 0.187210752/28709 [==========>...................] - ETA: 158s - loss: 241.3485 - acc: 0.186310880/28709 [==========>...................] - ETA: 156s - loss: 238.6422 - acc: 0.187011008/28709 [==========>...................] - ETA: 155s - loss: 235.9967 - acc: 0.186911136/28709 [==========>...................] - ETA: 154s - loss: 233.4130 - acc: 0.186911264/28709 [==========>...................] - ETA: 153s - loss: 230.8788 - acc: 0.187011392/28709 [==========>...................] - ETA: 152s - loss: 228.4048 - acc: 0.187211520/28709 [===========>..................] - ETA: 151s - loss: 225.9904 - acc: 0.187711648/28709 [===========>..................] - ETA: 149s - loss: 223.6267 - acc: 0.188011776/28709 [===========>..................] - ETA: 148s - loss: 221.3269 - acc: 0.188311904/28709 [===========>..................] - ETA: 147s - loss: 219.0528 - acc: 0.188312032/28709 [===========>..................] - ETA: 146s - loss: 216.8358 - acc: 0.188812160/28709 [===========>..................] - ETA: 145s - loss: 214.6630 - acc: 0.189612288/28709 [===========>..................] - ETA: 143s - loss: 212.5357 - acc: 0.189912416/28709 [===========>..................] - ETA: 142s - loss: 210.4445 - acc: 0.190512544/28709 [============>.................] - ETA: 141s - loss: 208.3913 - acc: 0.191212672/28709 [============>.................] - ETA: 140s - loss: 206.3823 - acc: 0.191612800/28709 [============>.................] - ETA: 139s - loss: 204.4177 - acc: 0.191612928/28709 [============>.................] - ETA: 137s - loss: 202.4895 - acc: 0.191913056/28709 [============>.................] - ETA: 136s - loss: 200.5973 - acc: 0.192213184/28709 [============>.................] - ETA: 135s - loss: 198.7395 - acc: 0.192613312/28709 [============>.................] - ETA: 134s - loss: 196.9102 - acc: 0.192813440/28709 [=============>................] - ETA: 133s - loss: 195.1283 - acc: 0.193313568/28709 [=============>................] - ETA: 132s - loss: 193.3692 - acc: 0.193813696/28709 [=============>................] - ETA: 131s - loss: 191.6488 - acc: 0.194213824/28709 [=============>................] - ETA: 130s - loss: 189.9689 - acc: 0.194013952/28709 [=============>................] - ETA: 128s - loss: 188.3077 - acc: 0.194514080/28709 [=============>................] - ETA: 127s - loss: 186.6768 - acc: 0.194714208/28709 [=============>................] - ETA: 126s - loss: 185.0721 - acc: 0.195214336/28709 [=============>................] - ETA: 125s - loss: 183.4934 - acc: 0.195514464/28709 [==============>...............] - ETA: 124s - loss: 181.9621 - acc: 0.196214592/28709 [==============>...............] - ETA: 123s - loss: 180.4493 - acc: 0.196014720/28709 [==============>...............] - ETA: 122s - loss: 178.9642 - acc: 0.196214848/28709 [==============>...............] - ETA: 121s - loss: 177.5063 - acc: 0.196314976/28709 [==============>...............] - ETA: 120s - loss: 176.0720 - acc: 0.195915104/28709 [==============>...............] - ETA: 119s - loss: 174.6531 - acc: 0.196315232/28709 [==============>...............] - ETA: 118s - loss: 173.2653 - acc: 0.196615360/28709 [===============>..............] - ETA: 117s - loss: 171.9028 - acc: 0.196615488/28709 [===============>..............] - ETA: 115s - loss: 170.5540 - acc: 0.196615616/28709 [===============>..............] - ETA: 114s - loss: 169.2247 - acc: 0.197015744/28709 [===============>..............] - ETA: 113s - loss: 167.9149 - acc: 0.197815872/28709 [===============>..............] - ETA: 112s - loss: 166.6261 - acc: 0.198016000/28709 [===============>..............] - ETA: 111s - loss: 165.3631 - acc: 0.198316128/28709 [===============>..............] - ETA: 110s - loss: 164.1255 - acc: 0.198416256/28709 [===============>..............] - ETA: 108s - loss: 162.9011 - acc: 0.198416384/28709 [================>.............] - ETA: 107s - loss: 161.6907 - acc: 0.198616512/28709 [================>.............] - ETA: 106s - loss: 160.5095 - acc: 0.198716640/28709 [================>.............] - ETA: 105s - loss: 159.3356 - acc: 0.198716768/28709 [================>.............] - ETA: 104s - loss: 158.1794 - acc: 0.198916896/28709 [================>.............] - ETA: 103s - loss: 157.0409 - acc: 0.199017024/28709 [================>.............] - ETA: 102s - loss: 155.9185 - acc: 0.199217152/28709 [================>.............] - ETA: 101s - loss: 154.8068 - acc: 0.199717280/28709 [=================>............] - ETA: 100s - loss: 153.7209 - acc: 0.199817408/28709 [=================>............] - ETA: 99s - loss: 152.6538 - acc: 0.2000 17536/28709 [=================>............] - ETA: 98s - loss: 151.5917 - acc: 0.200217664/28709 [=================>............] - ETA: 96s - loss: 150.5505 - acc: 0.200517792/28709 [=================>............] - ETA: 95s - loss: 149.5202 - acc: 0.200817920/28709 [=================>............] - ETA: 94s - loss: 148.5046 - acc: 0.201518048/28709 [=================>............] - ETA: 93s - loss: 147.5048 - acc: 0.201718176/28709 [=================>............] - ETA: 92s - loss: 146.5197 - acc: 0.201618304/28709 [==================>...........] - ETA: 91s - loss: 145.5484 - acc: 0.201018432/28709 [==================>...........] - ETA: 90s - loss: 144.5890 - acc: 0.201318560/28709 [==================>...........] - ETA: 88s - loss: 143.6463 - acc: 0.201718688/28709 [==================>...........] - ETA: 87s - loss: 142.7151 - acc: 0.202518816/28709 [==================>...........] - ETA: 86s - loss: 141.7976 - acc: 0.203118944/28709 [==================>...........] - ETA: 85s - loss: 140.8898 - acc: 0.203819072/28709 [==================>...........] - ETA: 84s - loss: 140.0038 - acc: 0.203519200/28709 [===================>..........] - ETA: 83s - loss: 139.1283 - acc: 0.204219328/28709 [===================>..........] - ETA: 82s - loss: 138.2521 - acc: 0.204519456/28709 [===================>..........] - ETA: 81s - loss: 137.3923 - acc: 0.204319584/28709 [===================>..........] - ETA: 80s - loss: 136.5460 - acc: 0.204219712/28709 [===================>..........] - ETA: 78s - loss: 135.7135 - acc: 0.204619840/28709 [===================>..........] - ETA: 77s - loss: 134.8874 - acc: 0.204719968/28709 [===================>..........] - ETA: 76s - loss: 134.0675 - acc: 0.204620096/28709 [===================>..........] - ETA: 75s - loss: 133.2679 - acc: 0.204720224/28709 [====================>.........] - ETA: 74s - loss: 132.4821 - acc: 0.204320352/28709 [====================>.........] - ETA: 73s - loss: 131.6971 - acc: 0.203920480/28709 [====================>.........] - ETA: 72s - loss: 130.9215 - acc: 0.204120608/28709 [====================>.........] - ETA: 71s - loss: 130.1511 - acc: 0.204620736/28709 [====================>.........] - ETA: 69s - loss: 129.4023 - acc: 0.204120864/28709 [====================>.........] - ETA: 68s - loss: 128.6506 - acc: 0.204420992/28709 [====================>.........] - ETA: 67s - loss: 127.9136 - acc: 0.204721120/28709 [=====================>........] - ETA: 66s - loss: 127.1815 - acc: 0.204621248/28709 [=====================>........] - ETA: 65s - loss: 126.4575 - acc: 0.204521376/28709 [=====================>........] - ETA: 64s - loss: 125.7423 - acc: 0.204921504/28709 [=====================>........] - ETA: 63s - loss: 125.0384 - acc: 0.204421632/28709 [=====================>........] - ETA: 62s - loss: 124.3481 - acc: 0.204421760/28709 [=====================>........] - ETA: 60s - loss: 123.6552 - acc: 0.204121888/28709 [=====================>........] - ETA: 59s - loss: 122.9757 - acc: 0.204322016/28709 [======================>.......] - ETA: 58s - loss: 122.3020 - acc: 0.204622144/28709 [======================>.......] - ETA: 57s - loss: 121.6331 - acc: 0.205022272/28709 [======================>.......] - ETA: 56s - loss: 120.9737 - acc: 0.205122400/28709 [======================>.......] - ETA: 55s - loss: 120.3237 - acc: 0.204822528/28709 [======================>.......] - ETA: 54s - loss: 119.6772 - acc: 0.204822656/28709 [======================>.......] - ETA: 53s - loss: 119.0361 - acc: 0.205222784/28709 [======================>.......] - ETA: 51s - loss: 118.4035 - acc: 0.205322912/28709 [======================>.......] - ETA: 50s - loss: 117.7809 - acc: 0.206023040/28709 [=======================>......] - ETA: 49s - loss: 117.1614 - acc: 0.206323168/28709 [=======================>......] - ETA: 48s - loss: 116.5477 - acc: 0.206423296/28709 [=======================>......] - ETA: 47s - loss: 115.9429 - acc: 0.206523424/28709 [=======================>......] - ETA: 46s - loss: 115.3419 - acc: 0.207123552/28709 [=======================>......] - ETA: 45s - loss: 114.7487 - acc: 0.207523680/28709 [=======================>......] - ETA: 44s - loss: 114.1616 - acc: 0.207623808/28709 [=======================>......] - ETA: 42s - loss: 113.5791 - acc: 0.207723936/28709 [========================>.....] - ETA: 41s - loss: 113.0056 - acc: 0.208324064/28709 [========================>.....] - ETA: 40s - loss: 112.4361 - acc: 0.208624192/28709 [========================>.....] - ETA: 39s - loss: 111.8741 - acc: 0.208524320/28709 [========================>.....] - ETA: 38s - loss: 111.3183 - acc: 0.208424448/28709 [========================>.....] - ETA: 37s - loss: 110.7666 - acc: 0.208424576/28709 [========================>.....] - ETA: 36s - loss: 110.2195 - acc: 0.208624704/28709 [========================>.....] - ETA: 35s - loss: 109.6781 - acc: 0.209224832/28709 [========================>.....] - ETA: 33s - loss: 109.1443 - acc: 0.2093