4
loading data from ../data/7class_simple_normalized/
Using real-time data augmentation
Loading network/training configuration...
Model summary...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 32, 48, 48)    320         convolution2d_input_1[0][0]      
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 32, 48, 48)    9248        convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 32, 48, 48)    9248        convolution2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 32, 24, 24)    0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 64, 24, 24)    18496       maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 64, 24, 24)    36928       convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 64, 24, 24)    36928       convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 64, 12, 12)    0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 128, 12, 12)   73856       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 128, 12, 12)   147584      convolution2d_7[0][0]            
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 128, 12, 12)   147584      convolution2d_8[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 128, 6, 6)     0           convolution2d_9[0][0]            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 4608)          0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 64)            294976      flatten_1[0][0]                  
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 64)            4160        dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 64)            0           dense_2[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 64)            256         dropout_1[0][0]                  
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 7)             455         batchnormalization_1[0][0]       
====================================================================================================
Total params: 780,039
Trainable params: 779,911
Non-trainable params: 128
____________________________________________________________________________________________________
None
X_train shape:  (28709, 1, 48, 48)
y_train shape:  (28709, 7)
  img size:  48 48
batch size:  128
  nb_epoch:  200
Epoch 1/200
  128/28709 [..............................] - ETA: 326s - loss: 1.9809 - acc: 0.1406  256/28709 [..............................] - ETA: 212s - loss: 2.0887 - acc: 0.1406  384/28709 [..............................] - ETA: 173s - loss: 2.1143 - acc: 0.1510  512/28709 [..............................] - ETA: 154s - loss: 2.1108 - acc: 0.1562  640/28709 [..............................] - ETA: 142s - loss: 2.0968 - acc: 0.1703  768/28709 [..............................] - ETA: 134s - loss: 2.0936 - acc: 0.1732  896/28709 [..............................] - ETA: 128s - loss: 2.0769 - acc: 0.1775 1024/28709 [>.............................] - ETA: 123s - loss: 2.0597 - acc: 0.1787 1152/28709 [>.............................] - ETA: 120s - loss: 2.0549 - acc: 0.1849 1280/28709 [>.............................] - ETA: 117s - loss: 2.0450 - acc: 0.1883 1408/28709 [>.............................] - ETA: 114s - loss: 2.0359 - acc: 0.1918 1536/28709 [>.............................] - ETA: 112s - loss: 2.0292 - acc: 0.1895 1664/28709 [>.............................] - ETA: 110s - loss: 2.0207 - acc: 0.1929 1792/28709 [>.............................] - ETA: 108s - loss: 2.0056 - acc: 0.1992 1920/28709 [=>............................] - ETA: 107s - loss: 1.9946 - acc: 0.1995 2048/28709 [=>............................] - ETA: 106s - loss: 1.9927 - acc: 0.2007 2176/28709 [=>............................] - ETA: 104s - loss: 1.9812 - acc: 0.2050 2304/28709 [=>............................] - ETA: 103s - loss: 1.9755 - acc: 0.2053 2432/28709 [=>............................] - ETA: 102s - loss: 1.9708 - acc: 0.2031 2560/28709 [=>............................] - ETA: 101s - loss: 1.9647 - acc: 0.2047 2688/28709 [=>............................] - ETA: 100s - loss: 1.9625 - acc: 0.2031 2816/28709 [=>............................] - ETA: 99s - loss: 1.9533 - acc: 0.2067  2944/28709 [==>...........................] - ETA: 98s - loss: 1.9443 - acc: 0.2099 3072/28709 [==>...........................] - ETA: 98s - loss: 1.9381 - acc: 0.2096 3200/28709 [==>...........................] - ETA: 97s - loss: 1.9309 - acc: 0.2119 3328/28709 [==>...........................] - ETA: 97s - loss: 1.9270 - acc: 0.2121 3456/28709 [==>...........................] - ETA: 96s - loss: 1.9208 - acc: 0.2135 3584/28709 [==>...........................] - ETA: 95s - loss: 1.9169 - acc: 0.2157 3712/28709 [==>...........................] - ETA: 94s - loss: 1.9126 - acc: 0.2155 3840/28709 [===>..........................] - ETA: 94s - loss: 1.9108 - acc: 0.2146 3968/28709 [===>..........................] - ETA: 93s - loss: 1.9095 - acc: 0.2135 4096/28709 [===>..........................] - ETA: 92s - loss: 1.9046 - acc: 0.2139 4224/28709 [===>..........................] - ETA: 92s - loss: 1.9008 - acc: 0.2150 4352/28709 [===>..........................] - ETA: 91s - loss: 1.8970 - acc: 0.2155 4480/28709 [===>..........................] - ETA: 91s - loss: 1.8942 - acc: 0.2165 4608/28709 [===>..........................] - ETA: 90s - loss: 1.8921 - acc: 0.2155 4736/28709 [===>..........................] - ETA: 90s - loss: 1.8900 - acc: 0.2154 4864/28709 [====>.........................] - ETA: 89s - loss: 1.8882 - acc: 0.2150 4992/28709 [====>.........................] - ETA: 88s - loss: 1.8868 - acc: 0.2155 5120/28709 [====>.........................] - ETA: 88s - loss: 1.8840 - acc: 0.2158 5248/28709 [====>.........................] - ETA: 87s - loss: 1.8819 - acc: 0.2165 5376/28709 [====>.........................] - ETA: 86s - loss: 1.8791 - acc: 0.2176 5504/28709 [====>.........................] - ETA: 86s - loss: 1.8769 - acc: 0.2168 5632/28709 [====>.........................] - ETA: 85s - loss: 1.8742 - acc: 0.2182 5760/28709 [=====>........................] - ETA: 85s - loss: 1.8726 - acc: 0.2186 5888/28709 [=====>........................] - ETA: 84s - loss: 1.8705 - acc: 0.2181 6016/28709 [=====>........................] - ETA: 84s - loss: 1.8683 - acc: 0.2189 6144/28709 [=====>........................] - ETA: 83s - loss: 1.8658 - acc: 0.2196 6272/28709 [=====>........................] - ETA: 82s - loss: 1.8649 - acc: 0.2192 6400/28709 [=====>........................] - ETA: 82s - loss: 1.8635 - acc: 0.2188 6528/28709 [=====>........................] - ETA: 81s - loss: 1.8613 - acc: 0.2188 6656/28709 [=====>........................] - ETA: 81s - loss: 1.8594 - acc: 0.2186 6784/28709 [======>.......................] - ETA: 80s - loss: 1.8585 - acc: 0.2185 6912/28709 [======>.......................] - ETA: 80s - loss: 1.8569 - acc: 0.2190 7040/28709 [======>.......................] - ETA: 79s - loss: 1.8551 - acc: 0.2190 7168/28709 [======>.......................] - ETA: 79s - loss: 1.8533 - acc: 0.2192 7296/28709 [======>.......................] - ETA: 78s - loss: 1.8513 - acc: 0.2196 7424/28709 [======>.......................] - ETA: 78s - loss: 1.8500 - acc: 0.2196 7552/28709 [======>.......................] - ETA: 77s - loss: 1.8489 - acc: 0.2195 7680/28709 [=======>......................] - ETA: 77s - loss: 1.8478 - acc: 0.2201 7808/28709 [=======>......................] - ETA: 76s - loss: 1.8460 - acc: 0.2208 7936/28709 [=======>......................] - ETA: 76s - loss: 1.8447 - acc: 0.2204 8064/28709 [=======>......................] - ETA: 75s - loss: 1.8432 - acc: 0.2202 8192/28709 [=======>......................] - ETA: 75s - loss: 1.8413 - acc: 0.2214 8320/28709 [=======>......................] - ETA: 74s - loss: 1.8407 - acc: 0.2214 8448/28709 [=======>......................] - ETA: 74s - loss: 1.8390 - acc: 0.2217 8576/28709 [=======>......................] - ETA: 73s - loss: 1.8377 - acc: 0.2222 8704/28709 [========>.....................] - ETA: 73s - loss: 1.8367 - acc: 0.2219 8832/28709 [========>.....................] - ETA: 72s - loss: 1.8361 - acc: 0.2221 8960/28709 [========>.....................] - ETA: 72s - loss: 1.8345 - acc: 0.2224 9088/28709 [========>.....................] - ETA: 72s - loss: 1.8339 - acc: 0.2228 9216/28709 [========>.....................] - ETA: 71s - loss: 1.8327 - acc: 0.2230 9344/28709 [========>.....................] - ETA: 71s - loss: 1.8307 - acc: 0.2241 9472/28709 [========>.....................] - ETA: 70s - loss: 1.8300 - acc: 0.2243 9600/28709 [=========>....................] - ETA: 70s - loss: 1.8287 - acc: 0.2254 9728/28709 [=========>....................] - ETA: 69s - loss: 1.8276 - acc: 0.2258 9856/28709 [=========>....................] - ETA: 69s - loss: 1.8270 - acc: 0.2256 9984/28709 [=========>....................] - ETA: 68s - loss: 1.8261 - acc: 0.226010112/28709 [=========>....................] - ETA: 68s - loss: 1.8247 - acc: 0.226910240/28709 [=========>....................] - ETA: 67s - loss: 1.8240 - acc: 0.227110368/28709 [=========>....................] - ETA: 67s - loss: 1.8232 - acc: 0.227010496/28709 [=========>....................] - ETA: 66s - loss: 1.8220 - acc: 0.228110624/28709 [==========>...................] - ETA: 66s - loss: 1.8215 - acc: 0.228210752/28709 [==========>...................] - ETA: 65s - loss: 1.8203 - acc: 0.229310880/28709 [==========>...................] - ETA: 65s - loss: 1.8196 - acc: 0.229711008/28709 [==========>...................] - ETA: 64s - loss: 1.8192 - acc: 0.229911136/28709 [==========>...................] - ETA: 64s - loss: 1.8191 - acc: 0.229611264/28709 [==========>...................] - ETA: 63s - loss: 1.8179 - acc: 0.230111392/28709 [==========>...................] - ETA: 63s - loss: 1.8171 - acc: 0.230411520/28709 [===========>..................] - ETA: 62s - loss: 1.8166 - acc: 0.230611648/28709 [===========>..................] - ETA: 62s - loss: 1.8160 - acc: 0.230911776/28709 [===========>..................] - ETA: 61s - loss: 1.8155 - acc: 0.231711904/28709 [===========>..................] - ETA: 61s - loss: 1.8146 - acc: 0.232412032/28709 [===========>..................] - ETA: 60s - loss: 1.8141 - acc: 0.232112160/28709 [===========>..................] - ETA: 60s - loss: 1.8140 - acc: 0.231912288/28709 [===========>..................] - ETA: 59s - loss: 1.8137 - acc: 0.232312416/28709 [===========>..................] - ETA: 59s - loss: 1.8135 - acc: 0.232012544/28709 [============>.................] - ETA: 58s - loss: 1.8137 - acc: 0.231712672/28709 [============>.................] - ETA: 58s - loss: 1.8137 - acc: 0.231112800/28709 [============>.................] - ETA: 57s - loss: 1.8132 - acc: 0.231212928/28709 [============>.................] - ETA: 57s - loss: 1.8132 - acc: 0.231013056/28709 [============>.................] - ETA: 56s - loss: 1.8131 - acc: 0.230713184/28709 [============>.................] - ETA: 56s - loss: 1.8126 - acc: 0.230713312/28709 [============>.................] - ETA: 55s - loss: 1.8127 - acc: 0.230213440/28709 [=============>................] - ETA: 55s - loss: 1.8125 - acc: 0.230313568/28709 [=============>................] - ETA: 54s - loss: 1.8123 - acc: 0.229913696/28709 [=============>................] - ETA: 54s - loss: 1.8127 - acc: 0.229413824/28709 [=============>................] - ETA: 53s - loss: 1.8129 - acc: 0.228713952/28709 [=============>................] - ETA: 53s - loss: 1.8129 - acc: 0.228314080/28709 [=============>................] - ETA: 53s - loss: 1.8126 - acc: 0.228814208/28709 [=============>................] - ETA: 52s - loss: 1.8121 - acc: 0.229514336/28709 [=============>................] - ETA: 52s - loss: 1.8119 - acc: 0.229014464/28709 [==============>...............] - ETA: 51s - loss: 1.8113 - acc: 0.229514592/28709 [==============>...............] - ETA: 51s - loss: 1.8112 - acc: 0.229314720/28709 [==============>...............] - ETA: 50s - loss: 1.8104 - acc: 0.230114848/28709 [==============>...............] - ETA: 50s - loss: 1.8100 - acc: 0.230714976/28709 [==============>...............] - ETA: 49s - loss: 1.8094 - acc: 0.231415104/28709 [==============>...............] - ETA: 49s - loss: 1.8087 - acc: 0.231515232/28709 [==============>...............] - ETA: 48s - loss: 1.8080 - acc: 0.231615360/28709 [===============>..............] - ETA: 48s - loss: 1.8073 - acc: 0.232215488/28709 [===============>..............] - ETA: 47s - loss: 1.8063 - acc: 0.232815616/28709 [===============>..............] - ETA: 47s - loss: 1.8061 - acc: 0.232815744/28709 [===============>..............] - ETA: 46s - loss: 1.8055 - acc: 0.233015872/28709 [===============>..............] - ETA: 46s - loss: 1.8053 - acc: 0.233116000/28709 [===============>..............] - ETA: 45s - loss: 1.8052 - acc: 0.233016128/28709 [===============>..............] - ETA: 45s - loss: 1.8047 - acc: 0.233116256/28709 [===============>..............] - ETA: 44s - loss: 1.8042 - acc: 0.233316384/28709 [================>.............] - ETA: 44s - loss: 1.8038 - acc: 0.233516512/28709 [================>.............] - ETA: 44s - loss: 1.8033 - acc: 0.233516640/28709 [================>.............] - ETA: 43s - loss: 1.8028 - acc: 0.233716768/28709 [================>.............] - ETA: 43s - loss: 1.8024 - acc: 0.233416896/28709 [================>.............] - ETA: 42s - loss: 1.8023 - acc: 0.233017024/28709 [================>.............] - ETA: 42s - loss: 1.8021 - acc: 0.232917152/28709 [================>.............] - ETA: 41s - loss: 1.8020 - acc: 0.232717280/28709 [=================>............] - ETA: 41s - loss: 1.8018 - acc: 0.232517408/28709 [=================>............] - ETA: 40s - loss: 1.8012 - acc: 0.233117536/28709 [=================>............] - ETA: 40s - loss: 1.8008 - acc: 0.233417664/28709 [=================>............] - ETA: 39s - loss: 1.8006 - acc: 0.233617792/28709 [=================>............] - ETA: 39s - loss: 1.8005 - acc: 0.233617920/28709 [=================>............] - ETA: 38s - loss: 1.8006 - acc: 0.233418048/28709 [=================>............] - ETA: 38s - loss: 1.8005 - acc: 0.233718176/28709 [=================>............] - ETA: 37s - loss: 1.8005 - acc: 0.2335